{
  "name": "Aubergine Casserole",
  "title": "Aubergine Casserole",
  "imageAltText": "Aubergine casserole served in a bowl with bread and a drink",
  "serves": "3-4 people",
  "ingredients": [
    {
      "quantity": "5",
      "item": "aubergines"
    },
    {
      "quantity": "2",
      "item": "peppers (pref. green)"
    },
    {
      "quantity": "1",
      "item": "onion"
    },
    {
      "quantity": "6 cloves",
      "item": "garlic"
    },
    {
      "quantity": "350g",
      "item": "plum / cherry tomatoes"
    },
    {
      "quantity": "400g tin",
      "item": "chopped tomatoes"
    },
    {
      "quantity": "400g tin",
      "item": "chickpeas"
    },
    {
      "quantity": "1 + 1/2 tbsp",
      "item": "tomato puree"
    },
    {
      "quantity": "1 + 1/2 tsp",
      "item": "sugar"
    },
    {
      "quantity": "1/2 tsp",
      "item": "cinnamon"
    },
    {
      "quantity": "1 tsp",
      "item": "cumin"
    },
    {
      "quantity": "1 tsp",
      "item": "chilli flakes"
    },
    {
      "quantity": "bunch",
      "item": "fresh coriander"
    },
    {
      "item": "olive oil"
    },
    {
      "item": "salt"
    },
    {
      "item": "black pepper"
    },
    {
      "item": "crusty bread (optional)"
    }
  ],
  "instructions": [
    "Preheat oven to 220 Celcius",
    "Wash and cut the aubergines into 1.5cm slices lengthways.",
    "Add to a baking tray with at least 75ml olive oil, with a teaspoon each of salt and pepper. Mix well: make sure each slice has oil and seasoning.",
    "Roast for 30 minutes. Reduce the temperature to 180 Celcius and continue roasting for another 10-15 minutes (you can continue the steps below while it cooks).",
    "Dice the onion. Crush the garlic. Chop the peppers. Put the cinnamon, chilli flakes and cumin seeds in a grinder, crush well.",
    "Add 2 tablespoons of olive oil to a pan on medium-high heat. Fry the onions for 5-7 minutes until soft and light brown. Then add the spices, garlic and tomato paste. Cook for 1 minute.",
    "Boil some water. Add the peppers, chickpeas, tinned tomatoes and sugar. Add 200ml of the boiling water. Season with just over a teaspoon of salt and a strong pinch of black pepper. Simmer for 15-20 minutes.",
    "Chop the coriander and add that to the sauce towards the end.",
    "Line an ovenproof dish with a 1/2 tablespoon of olive oil and a layer of sliced tomatoes. Spread half the aubergine mix on top. Then layer the sauce. Final layer of tomatoes + aubergine.",
    "Drizzle with some olive oil, wrap in aluminium foil and cook in the oven for 30 minutes. Optionally remove the foil and cook for a further 20 minutes.",
    "Garnish with a bit of coriander and serve with crusty bread."
  ]
}
