{
  "name": "Salmon & Leek Lasagna",
  "title": "Salmon and Leek Lasagna",
  "imageAltText": "Salmon and leek lasagna on a plate",
  "serves": "3-4 people",
  "ingredients": [
    {
      "quantity": "750g",
      "item": "salmon"
    },
    {
      "quantity": "2-3",
      "item": "leeks"
    },
    {
      "quantity": "1",
      "item": "courgette"
    },
    {
      "quantity": "900ml",
      "item": "whole milk"
    },
    {
      "quantity": "110g",
      "item": "butter"
    },
    {
      "quantity": "80g",
      "item": "emmental cheese"
    },
    {
      "quantity": "9-12",
      "item": "lasagna sheets"
    },
    {
      "item": "olive oil"
    },
    {
      "item": "salt"
    },
    {
      "item": "black pepper"
    },
    {
      "item": "nutmeg (optional)"
    },
    {
      "item": "dill (optional)"
    }
  ],
  "instructions": [
    "Thorougly wash and chop the leeks and courgette into 1/2cm slices. Ensure salmon is defrosted and cleaned. Crumble the salmon into small pieces, ensuring there are no bones. Grate the cheese.",
    "Preheat the oven to 200C.",
    "Begin to lighly fry the leeks & courgette for 10-12 minutes in a covered pan with 2 tablespoons of olive oil and 30g of butter. After 8 minutes, add the salmon flakes to partially cook them. Add about a half teaspoon of dill.",
    "Melt 70g of butter in a large saucepan on low heat. Gradually add flour, toasting it and stirring constantly. Add the milk gradually (optionally heat it first with salt). Beat and stir until it is all integrated and the flour lumps are dissolved.",
    "Cook for 6-8 minutes. Season the bechamel with a salt, pepper and a light (!) shaving of nutmeg to taste.",
    "Line a large ovenproof dish with baking paper (or coat with olive oil) and put down 1 layer of lasagna sheets. Add a little bechamel source (make sure the corners are covered!), then some leek/salmon mix and a light sprinkle of grated cheese.",
    "Repeat this process 2-3 more times and make sure the last layer is lasagna sheets, a little bechamel and the rest of the cheese. Sprinkle some dill as a garnish before or after cooking.",
    "Cook for 20 minutes. Enjoy :)"
  ]
}
