{
  "name": "Spinach and Feta Pastry Braid",
  "title": "Spinach and Feta Pastry Braid",
  "imageAltText": "Spinach and Feta Pastry Braid",
  "serves": "2 people",
  "ingredients": [
    {
      "quantity": "1 roll",
      "item": "puff pastry"
    },
    {
      "quantity": "1",
      "item": "onion (medium)"
    },
    {
      "quantity": "300g",
      "item": "fresh spinach"
    },
    {
      "quantity": "2 cloves",
      "item": "garlic"
    },
    {
      "quantity": "100g",
      "item": "spreadable cheese / ricotta"
    },
    {
      "quantity": "75g",
      "item": "feta cheese"
    },
    {
      "item": "pine nuts"
    },
    {
      "item": "sesame seeds"
    },
    {
      "item": "olive oil"
    },
    {
      "item": "salt"
    },
    {
      "item": "pepper"
    },
    {
      "item": "nutmeg"
    }
  ],
  "instructions": [
    "Dice the onions. Crush, press or mince the garlic. Chop the feta into small cubes.",
    "Wash the spinach in a colander.",
    "Heat a large pan to medium-high heat. Add around a tablespoon of olive oil when the pan is hot. Add the onions. Fry for 2-3 minutes until soft.",
    "Reduce the heat and add the garlic. Cook for an additional 1-2 minutes. Take the puff pastry out of the fridge.",
    "Stop the heat to the pan. Add the spinach, some salt, pepper, nutmeg, pine nuts and the 2 cheeses. Leave to one side and allow the remaining heat from the pan to gently wilt the spinach and melt the spreadable cheese. The spinach doesn't need to be fully wilted - you just want to have a mixture that is relatively well combined :)",
    "Unroll the pastry onto a baking tray with baking paper underneath. Preheat the oven to the recommended temperature on the pastry packaging. For a non-fan assisted oven, we used 220C.",
    "Imagine 3 evenly spaced vertical columns on your pastry. The middle section will hold the mixture. For the left and right columns, make 1cm - 1 inch cuts at a 45 degree angle, from top to bottom.",
    "Spoon the spinach mixture onto the middle column of the pastry.",
    "Fold the pastry strips over the mixture in the middle. Alternate left and right strips over each other in a braid pattern.",
    "Sprinkle sesame seeds over the pastry. You could use an egg wash if you like, but it's just to make the pastry shine a bit more, it's not necessary.",
    "Place the pastry into the oven for around 20 minutes, or when the pastry colour is golden brown. Bravo! Enjoy!"
  ]
}
