{
  "name": "Thai Green Curry",
  "title": "Thai Green Curry",
  "serves": "5-6 people",
  "ingredients": [
    {
      "quantity": "1 large can",
      "item": "chickpeas"
    },
    {
      "quantity": "2-3",
      "item": "bell peppers"
    },
    {
      "quantity": "3 cloves",
      "item": "garlic"
    },
    {
      "quantity": "small peice",
      "item": "ginger"
    },
    {
      "quantity": "2 medium",
      "item": "yellow onions"
    },
    {
      "quantity": "2-3",
      "item": "spring onions"
    },
    {
      "quantity": "3 medium",
      "item": "potatoes"
    },
    {
      "quantity": "1 bag",
      "item": "green beans"
    },
    {
      "quantity": "1 handful",
      "item": "garden peas"
    },
    {
      "quantity": "50g",
      "item": "thai curry paste"
    },
    {
      "quantity": "1",
      "item": "stock cube / pot"
    },
    {
      "quantity": "1 can",
      "item": "coconut milk"
    },
    {
      "quantity": "2-3 mugs",
      "item": "brown rice"
    },
    {
      "item": "fresh coriander"
    },
    {
      "item": "coconut oil"
    },
    {
      "item": "soy sauce"
    },
    {
      "item": "turmeric"
    },
    {
      "item": "cumin"
    }
  ],
  "instructions": [
    "Take the metal pot out of the slow cooker and place it on the stove, medium-high heat.",
    "Roughly chop the onions & bell peppers into strips. Peel the potatoes and chop into large chunks (1 inch wide is good). Mince, press or crush the garlic. Grate the ginger.",
    "Add a teaspoon of coconout oil to the pot & when hot enough, add the onions.",
    "Cook the onions for 2-3 minutes.",
    "Add 1/2 teaspoons of turmeric and cumin (plus any other spices you like). Stir for 30 seconds.",
    "Add the garlic, ginger and curry paste. Stir for 30 seconds. Start boiling around 1/2 litre of ,water.",
    "Stop the heat from the stove. Add the bell peppers, spring onions, chickpeas, potatoes. Stir a bit.",
    "Once the water is boiled, add the stockpot and about 1/2 litre of water. Make sure the stock cube or pot is well dispersed (if using a stock cube, make the broth beforehand).",
    "Transfer to the slow cooker and cook on high for 3 + 1/2 hours. Stir occasionally.",
    "Add the cream (not the milk, from the coconut milk can) and the peas + beans. Frozen peas can just go straight into the pot. Add some salt, pepper and a few dashes of soy sauce.",
    "Cook on low for 1-2 more hours, as you like.",
    "For the rice, measure 2 + 1/2 mugs of water for each 1 mug of rice. You could use the coconut milk if you wish instead of (or in addition to) the water.",
    "Cook on a gentle simmer for 30 minutes (for brown rice), or as long as the instructions on the packet tell you to cook it for.",
    "Chop the leaves and add the fresh coriander if you have any. Give it one last stir and then serve. Enjoy!"
  ]
}
